import pdfjsWorker from "pdfjs-dist/build/pdf.worker.entry";

GlobalWorkerOptions.workerSrc = pdfjsWorker;

import { ToastContainer, toast } from "react-toastify";

[
  {
    id: 1,
    question: "تعرضت اوروبا لانتكاسه حضاريه من خلال",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 0,
    image:
      "",
  },
  {
    id: 2,
    question: "تم اكتشاف قاره استراليا في",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 1,
    image:"",
  },
  {
    id: 3,
    question: "العامل االساسي الذي يعد اول بناء معظم الحضارات القديمه هو",
    options: [
      "معرفه االإنسان الزراعه",
      "معرفه االإنسان الكتابه",
      "بناء المعاقد و المقابر",
      "معرفه و اكتشاف المعادن",
    ],
    correctAnswer: 1,
    image: null,
  },
  {
    id: 4,
    question:
      "ادت الرحالت االستكشافيه للرحاله االوروبين خلال العصور الحديثه الي",
    options: [
      "قيام الثور ه الصناعيه",
      "ظهور النهضه االوروبيه",
      "قيام حركه االستعمار االوروبي",
      "حدوث حركات التحرر و االستقالل",
    ],
    correctAnswer: 2,
    image: null,
  },
  {
    id: 5,
    question: "اطول اشعاع حضاري علي مر العصور التاريخيه كان منبعه من",
    options: ["الشرق االوسط", "الدول االوروبيه", "شمال اسيا", "بالد الفرس"],
    correctAnswer: 1,
    image: null,
  },
  {
    id: 6,
    question:
      "تم الفتح االسالمي لمص ر في عهد الخليفة ( عمر بن الخطاب ) ينتمي هذا الحدث الي",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 0,
    image: null,
  },
  {
    id: 7,
    question: "ركز المؤرخ ول ديورانت في مفهومه للحضاره علي",
    options: [
      "تفاعل االإنسان مع البيئه",
      "استخدام الموارد الطبيعيه",
      "العالقات االن سانيه",
      "اهميه المخترعات المختلفه",
    ],
    correctAnswer: 3,
    image: null,
  },
  {
    id: 8,
    question:
      "تعطي دراسه التاريخ تصورآ واضحآ عن احوال العالم القديم و تجاربه من اجل",
    options: [
      "تجنب االخطاء في المستقبل",
      "االستفاده من دراسه العلوم المختلفه",
      "االستفاده منها في كتابه الروايات",
      "تحرير االإنسان من الخوف",
    ],
    correctAnswer: 0,
    image: null,
  },
  {
    id: 9,
    question:
      "يتشابه النص العبارة المذكورة في الأعلى مع احد اهداف دراسة التاريخ وهو",
    options: [
      "إبراز القدوة الصالحة",
      "استخالص العبر",
      "تنمية الشعور بالمسئولية",
      "االبتعاد عن التعصب",
    ],
    correctAnswer: 2,
    image: null,
  },
  {
    id: 10,
    question: "١ - حاول المسلمون فتح مدينه القسطنطينيه اكثر من مره في",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التا ريخ المعاصر\nأ /",
    ],
    correctAnswer: 1,
    image: null,
  },
  {
    id: 11,
    question:
      "١ - في ضوء العبارة العبارة المذكورة في الأعلىة يتوافق دور منظمات المجتمع المدني مع اهمية دراسة التاريخ المتمثلة في",
    options: [
      "االبتعاد عن التعصب",
      "استخالص العبر",
      "إبراز القدوة الصالحة",
      "تنمية الشعور بالمسئولية",
    ],
    correctAnswer: 2,
    image: null,
  },
  {
    id: 12,
    question:
      "اخذت الحضاره االسالميه المصير من الحضارات الف ارسيه و الهنديه و اليونانيه في العلوم المختلفه و طورتها و كان نتائج ذلك نواه لبناء الحضاره االوروبيه الحديثه  تعبر الفقره السابقه عن احدي اهداف دراسه التاريخ و هي",
    options: [
      "استخالص العير من تاريخ االمم",
      "ابراز القدوه الصالحه",
      "تنميه الشعور بالمسؤليه",
      "اال بتعاد عن التعصب",
    ],
    correctAnswer: 0,
    image: null,
  },
  {
    id: 13,
    question: "ازدهرت الحضارات في الشرق و الغرب علي حد سواء خلال",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 2,
    image: null,
  },
  {
    id: 14,
    question: "استطاعت الدول االمويه فتح بالد االندلس في",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 1,
    image: null,
  },
  {
    id: 15,
    question: "بدأ استخدام االالت المعتمده علي الطاقه الحفريه في",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التاريخ المعاصر",
    ],
    correctAnswer: 0,
    image: null,
  },
  {
    id: 16,
    question:
      "استفاد الزعيم الوطني مصطفي كامل من اخطاء قاده الثوره العرابيه في الكفاح الوطني ضد الوجود االنجليزي بمصر  تشير العباره السابقه الحدي دراسه التاريخ و هي",
    options: [
      "ابراز القدوه الصالحه",
      "تنميه الشعور بالمسؤليه",
      "االبتعاد عن التعصب",
      "استخالص العبر",
    ],
    correctAnswer: 2,
    image: null,
  },
  {
    id: 17,
    question: "انتقلت الحضاره من الغرب الي الشرق خلال",
    options: [
      "العصور القديمه",
      "العصور الوسطي",
      "العصور الحديثه",
      "التار يخ المعاصر",
    ],
    correctAnswer: 1,
    image: null,
  },
  {
    id: 18,
    question:
      "تسعي دراسه التاريخ الي تحقيق الوحده و التضامن بين مختلف الشعوب من خلال",
    options: [
      "االبتعاد عن التعصب",
      "ابراز القدوه الصالحه",
      "تنميه الشعور بالمسؤليه",
      "استخالص العبر من تاريخ االمم",
    ],
    correctAnswer: 2,
    image: null,
  },
];